[{"title":"About this guide","children":[{"title":"How to use this guide","content":"Instead of how most guides are used — you read what you can/should do next and then do it, I recommend doing it the other way around. Do as much as you can yourself, explore, fight, look for chests. Whenever you come across an item, an NPC or something else of note, mark it in the guide (\"Got it!\" button). Only when you've explored all of a given area and found everything you can, check back with the guide to see if you're still missing anything.","id":"dd95d669-eadf-459d-83cb-97610aa70c07"}],"id":"4a1e82b9-f399-4166-81e5-babd00231796"},{"title":"General game information","children":[{"title":"Saving and loading","content":"Dark Souls saves the game almost constantly. If you make a mistake, such as accidentally attack an NPC, upgrade the wrong weapon or level up the wrong stats, there is no way to go back. This is by design, but might not always be fair (for example, dying because of a technical glitch rather than gameplay). The only way to work around this is on the PC — either manually create copies of your save file or link it to a cloud storage service like Dropbox that keeps old versions of files and lets you restore them.","id":"bb88d645-a3c0-4ee7-bcff-9680062b7c93"}],"id":"9147bfd5-8b2f-4a2b-a2d8-334f03fb8d33"},{"title":"Character Creation (gifts)","children":[{"title":"Consumable gift amounts","labels":["info"],"content":"Goddess's Blessing: ×3, Black Firebomb: ×10, Twin Humanities: ×1. All others are permanent (non-consumable) items.","id":"962b60ca-90c0-4380-a613-608db6db4b55"},{"title":"Tiny Being's Ring is a lie!","labels":["warning"],"content":"{Tiny Being's Ring} gift description says it regenerates lost health over time. <strong>That is not true!</strong> It actually gives a small bonus to how much health you have.","id":"210c4379-bcf8-4f92-b3cb-de66fae2f2b4"},{"title":"Usefulness of other gifts","labels":["info"],"content":"{Master Key} unlocks several shortcuts between the starting area and some later ones, giving earlier access to higher level items and enemies (and the option of skipping some early game parts).<br />{Black Firebomb}s: Powerful offensive item, can make several early bosses easier.<br />{Twin Humanities}: Consumable item, gives 2 Humanity points. See humanity explanation further in the guide.<br />{Binoculars}: Does what it says, but not very useful in the Undead Asylum (you're mostly indoors) and another can be found very soon after leaving the Asylum.<br />{Pendant}: virtually useless, game creator himself has described it as a \"prank\".<br />{Old Witch's Ring}: Provides a small amount of extra dialog text later, near mid-game.","id":"fe25810c-71d9-429e-87d4-aeaa47b01b1a"},{"title":"Bombs for demon's hammer","labels":["spoiler","ocd"],"content":"The first boss you meet in Undead Asylum is not supposed to be defeated until you get your weapon. You can, however, do it relatively easily if you pick {Black Firebomb}s as your starting gift and use them. If (and only if) you kill him before getting your weapon, he will drop a {Demon's Great Hammer}. The weapon is mostly useless though, as it requires 46 strength to wield and you can get another one way before you can level up that far.","id":"639b2cf7-05d1-4ee9-b4e2-48ebbcb1475f"}],"id":"e2a7ab4f-db11-40cd-87e1-26ae717ad1bf"},{"title":"Early game","children":[{"title":"Northern Undead Asylum","children":[{"title":"Before fog gate","children":[{"title":"Dungeon Cell Key","labels":["item","checklist","unmissable"],"id":"bb22d01a-7e80-4212-85a7-9c2cc8b33c30"},{"title":"Estus Flask","labels":["item","checklist","unmissable"],"id":"2943dcc5-9709-4301-9204-ce1e8b1f7ace"},{"title":"Undead Asylum F2 East Key","labels":["item","checklist","unmissable"],"id":"7611f825-8aec-4b4d-b3ae-715b99c27d12"},{"title":"Weapon (depending on class)","labels":["item","checklist"],"Flags":["abstract"],"id":"62fb279e-d8c2-44cb-a6f8-5cbdbfafac7c"},{"title":"Shield (depending on class)","labels":["item","checklist"],"Flags":["abstract"],"id":"7c85eeb9-548d-4b82-8082-227379f02d32"},{"title":"Catalyst if Sorcerer / Pyromancy flame if Pyromancer","labels":["item","checklist"],"Flags":["abstract"],"id":"f5266859-8df3-40f5-8e4a-4db2e117972e"}],"id":"360c3087-8cdc-4eb8-8f3c-1fb1d0a819e9"}],"id":"555fdb72-1749-4982-b620-5fcf61bf8310"},{"$include":"early/firelink.json","title":"Firelink Shrine","children":[{"title":"First arrival","children":[{"title":"Careful around NPCs!","labels":["warning"],"content":"NPCs can be attacked and killed, which also means you can attack them by accident. An NPC you have attacked will remain hostile <strong>for the rest of the playthrough</strong> and you will miss out on everything he might have to offer (side quests, item purchases, exposition, etc.).","id":"2164cebf-1cbd-4b15-b788-9626fc87f73e"},{"title":"Talking to NPCs","labels":["info"],"content":"NPCs don't always say everything immediately. Keep talking to them until they start repeating themselves if you don't want to miss anything. And whenever you defeat a boss, open a new area or do something similarly permanent, it's a good idea to check back with NPCs and talk to them again as they might have gained new dialog, moved to another area or otherwise changed.","id":"cb8ce492-f120-42fd-8562-66a7e23062fe"},{"title":"Leveling up: Resistance","labels":["warning"],"content":"Avoid spending souls on increasing Resistance. While physical, fire and poison resistance sounds good, very few enemies apart from bosses actually use either fire or poison, and such attacks are best avoided anyway. In cases where evasion is a problem, there's usually a suit of armor to compensate. Armor also has a much more effect on your physical defense than resistance ever could, and every other stat is more valuable.","id":"99707e6a-46c5-438f-ba89-445d1258c35a"},{"title":"How does Humanity work?","labels":["info"],"content":"Humanity is a stat that is increased almost exclusively by using {Humanity} items dropped by enemies / found as treasure. It is lost and recovered the same way as souls. Humanity points increase all defenses and curse resistance, as well as damage dealt with all Chaos weapons, {Quelaag's Furysword} and {Abyss Greatsword}. The first 10 points of Humanity also increase the chance of enemies dropping items when they die.","id":"fd924087-cb9d-423f-ad3b-183078eed6f2"},{"title":"What does Reverse Hollowing do?","labels":["info"],"content":"At the cost of 1 Humanity point, \"Reverse Hollowing\" option turns your character from hollow to human form. Human form is required for two things: participating in multiplayer and kindling bonfires. When you die, you lose your human form and it is not restored when you retrieve your Souls and Humanity points. Thus, the Humanity point you spent on becoming human it is permanently lost.","id":"b56d7ea8-5c3a-430c-9fed-0e7c2207eae6"},{"title":"How does multiplayer work?","labels":["info"],"content":"This is a single-player (PvE, Player vs. Engine) guide, so it will not contain in depth information on multiplayer (PvP, Player vs. Player). At its core, taking part in online multiplayer (being in human form) lets you participate in other people's games and them in yours, either co-operating with (summoning) or fighting against one another other (invasion).","id":"106f23e6-df19-4006-9e4b-3bfce6bd0bf1"},{"title":"What does Kindle do?","labels":["info"],"content":"At the cost of 1 Humanity point, \"Kindle\" increases the amount of {Estus Flasks} the bonfire restores. You have to be in human form to perform Kindle. Any bonfire that restores 10 Estus Flasks is already kindled.","id":"ed7d6dd3-170f-475b-b867-ba95bbf8e46a"}],"id":"f42075d0-0930-4f73-88d6-ae70a07e4114"}]}],"id":"50cc6868-305b-4c8f-b1d9-38cb492742b0"}]